musica/index.org

#+STARTUP: showall

#+TITLE: Eclats de vers : Opus : Musica
#+AUTHOR: chimay
#+EMAIL: or du val chez gé courriel commercial
#+LANGUAGE: fr
#+LINK_HOME: file:../index.html
#+LINK_UP: file:../index.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style/defaut.css" />

#+OPTIONS: H:6
#+OPTIONS: toc:nil

#+INCLUDE: "../include/navigan-1.org"

#+TOC: headlines 1

#+TAGS: noexport(n)

* Modèles lilypond

#+TOC: headlines 1 local

** Introduction

Les fichiers présentés dans ce chapitre sont des modèles d’orchestres
disponibles en format [[https://lilypond.org/][lilypond]]. Pour une
navigation plus rapide, le pliage de texte (folding) des éditeurs
[[https://www.vim.org/][vim]] / [[https://neovim.io/][neovim]] est inclus.

** Méta-orchestre

Le fichier le plus important est le
[[file:lilypond/template/meta.ly][méta-orchestre]], qui contient
de nombreux instruments et groupes d’instruments. Vous pouvez
l’utiliser pour construire un orchestre à la carte, en décommentant
ou commentant les instruments et les groupes dans la section "book" à
la fin du fichier, respectivement pour les activer ou les désactiver.

Le fichier [[file:lilypond/template/neutral.ly][neutre]] est pareil,
mais tous les intruments et groupes sont commentés, en attente d’être
choisis.

Les thèmes mélodiques peuvent s’insérer dans les définitions des
variables mélodiques commençant par "voice". Par exemple, la variable
"voicePianoRight" contient la mélodie de la main droite au piano.

Dans le cas d’un groupe d’instrument qui recouvre une large étendue
de notes, les voix du groupe sont nommées depuis soprano (la plus aiguë)
jusqu’à basse (la plus grave). Par exemple, pour un quintette à
cordes, ce sera :

- voiceStringQuintetSoprano
- voiceStringQuintetMezzo
- voiceStringQuintetAlto
- voiceStringQuintetTenor
- voiceStringQuintetBass

Voici la liste des instruments et groupes que ce fichier contient :

- chant
  + voix individuelles
    * soprano
    * mezzo
    * alto
    * contre-ténor
    * ténor
    * baryton
    * basse
  + quatuor vocal
    * soprano alto ténor basse
  + quintette vocal
    * soprano mezzo alto ténor basse
  + sextuor vocal
    * soprano mezzo alto ténor baryton basse
  + septuor vocal
    * soprano mezzo alto contre-ténor ténor baryton basse
- bois
  + paires de bois individuels
    * 2 piccolos
    * flûtes
      - grande flûte traversière
      - flûte alto
    * 2 hautbois
    * 2 clarinettes
    * 2 cors anglais
    * 2 bassons
    * 2 saxophones soprano
    * 2 saxophones alto
    * 2 saxophones ténor
    * 2 saxophones baryton
    * cornemuse
  + quatuor de bois
    * grande flûte traversière
    * hautbois
    * clarinette
    * basson
  + quintette de bois
    * grande flûte traversière
    * hautbois
    * clarinette
    * cor anglais
    * basson
  + sextuor de bois
    * grande flûte traversière
    * flûte alto
    * hautbois
    * clarinette
    * cor anglais
    * basson
  + quatuor de saxophones
    * 2 saxophones soprano
    * 2 saxophones ténor
- cuivres
  + paires de cuivres individuels
    * 2 trompettes
    * 2 cors d’harmonie
    * 2 trombones
    * 2 tubas
  + quatuor de cuivres
    * 2 trompettes
    * 2 cors d’harmonie
  + quintette de cuivres
    * 2 trompettes
    * 1 cor d’harmonie
    * 1 trombone
    * 1 tuba
- anches libres
  + harmonica
- instruments à vent avec clavier
  + orgue sans pédalier
    * orgue positif, harmonium, orgue hammond
  + orgue avec pédalier
    * orgue positif, harmonium, orgue hammond, orgue d’église
  + accordéon
  + concertina
- cordes frottées
  + paires de cordes frottées individuelles
    * 2 violons
    * 2 violons alto
    * 2 violoncelles
    * 2 contrebasses
  + quatuor à cordes
    * 2 violons
    * 1 violon alto
    * 1 violoncelle
  + quatuor à cordes symétrique
    * 2 violons
    * 2 violoncelles
  + quatuor à cordes avec contrebasse
    * violon
    * violon alto
    * violoncelle
    * contrebasse
  + quintette à cordes
    * 2 violons
    * 2 violons alto
    * 1 violoncelle
  + quintette à cordes symétrique
    * 2 violons
    * 1 violon alto
    * 2 violoncelles
  + quintette à cordes avec contrebasse
    * 2 violons
    * 1 violon alto
    * 1 violoncelle
    * 1 contrebasse
  + sextuor à cordes
    * 2 violons
    * 2 violons alto
    * 2 violoncelles
  + septuor à cordes
    * 2 violons
    * 2 violons alto
    * 2 violoncelles
    * 1 contrebasse
- cordes pincées
  + luth
    * portée ordinaire
    * tablature
  + archiluth
    * portée ordinaire
    * tablature
  + théorbe
    * portée ordinaire
    * tablature
  + guitare
    * portée ordinaire
    * tablature
  + guitare basse
    * portée ordinaire
    * tablature
  + sitar
  + harpe
- cordes frappées
  + dulcimer
- instruments à cordes avec clavier
  + viola organista
    * clavier avec cordes frottées par des roues
  + clavecin
  + clavecin avec pédalier
  + clavicorde
  + piano
- percussions
  + glockenspiel
  + vibraphone
  + marimba
  + carillon tubulaire
  + batterie
- percussions avec clavier
  + célesta

Ces instruments et groupes sont disposés le plus possible avec deux
mélodies par portée, pour obtenir une partition plus compacte.

Les instruments individuels tirent leur nom du fait qu’on peut
activer un seul type d’instrument à la fois. Certains d’entre-eux
sont en fait disponibles par paires : flûtes, hautbois, trompettes,
trombones, violons, violoncelles, etc. Chaque paire d’instruments
est alors representés comme deux mélodies disposées sur une même
portée. Si vous avez uniquement besoin d’un seul de ces instruments,
il est possible de ne remplir que la variable mélodique du premier,
par exmple "voiceFluteOne" pour la première flûte. Pour retrouver
la représentation habituelle des notes sur une portée à une voix,
on peut alors insérer "\oneVoice" au début de la variable.

** Fichiers principaux

Les autres modèles d’orchestres sont dérivés du
méta-orchestre. Voici quelques exemples de partitions (au format pdf)
générées avec ces fichiers :

- [[file:template/meta.org][méta-orchestre]]
- [[file:template/vocal-quartet.org][quatuor vocal]]
- [[file:template/vocal-quintet.org][quintet vocal]]
- [[file:template/vocal-sextet.org][sextuor vocal]]
- [[file:template/vocal-septet.org][septuor vocal]]
- [[file:template/winds.org][ensemble d’instruments à vent]]
- [[file:template/woodwinds.org][ensemble de bois]]
- [[file:template/brass.org][ensemble de cuivres]]
- [[file:template/strings.org][ensemble d’instruments à cordes]]
- [[file:template/string-quartet.org][quatuor à cordes]] :
  2 violons, 1 violon alto, 1 violoncelle
- [[file:template/string-quartet-symmetric.org][quatuor à cordes symétrique]] :
  2 violons et 2 violoncelles
- [[file:template/string-quartet-contrabass.org][quatuor à cordes avec contrebasse]] :
  violon, violon alto, violoncelle et contrebasse
- [[file:template/string-quintet.org][quintette à cordes]] :
  2 violons, 2 violons alto, 1 violoncelle
- [[file:template/string-quintet-symmetric.org][quintette à cordes symétrique]] :
  2 violons, 1 violon alto, 2 violoncelles
- [[file:template/string-quintet-contrabass.org][quintette à cordes avec contrebasse]] :
  2 violons, 1 violon alto, 1 violoncelles, 1 contrebasse
- [[file:template/string-sextet.org][sextuor à cordes]]
- [[file:template/string-septet.org][septuor à cordes]]
- [[file:template/piano-quintet.org][quintette à clavier]]
- [[file:template/keyboards.org][ensemble de claviers]]
- [[file:template/drums.org][ensemble de percussions]]
- [[file:template/boudoir.org][boudoir]] : flûtes, quatuor à cordes, clavier
- [[file:template/chamber.org][ensemble de musique de chambre]]
- [[file:template/jazz.org][ensemble de jazz]]

et les fichiers source lilypond :

- [[file:lilypond/template/neutral.ly][neutre]] : tous les instruments sont commentés, en attente d’être choisis
- [[file:lilypond/template/meta.ly][méta-orchestre]]
- [[file:lilypond/template/vocal-quartet.ly][quatuor vocal]]
- [[file:lilypond/template/vocal-quintet.ly][quintette vocal]]
- [[file:lilypond/template/vocal-sextet.ly][sextuor vocal]]
- [[file:lilypond/template/vocal-septet.ly][septuor vocal]]
- [[file:lilypond/template/winds.ly][ensemble d’instruments à vent]]
- [[file:lilypond/template/woodwinds.ly][ensemble de bois]]
- [[file:lilypond/template/brass.ly][ensemble de cuivres]]
- [[file:lilypond/template/strings.ly][ensemble d’instruments à cordes]]
- [[file:lilypond/template/string-quartet.ly][quatuor à cordes]]
- [[file:lilypond/template/string-quartet-symmetric.ly][quatuor à cordes symétrique]]
- [[file:lilypond/template/string-quartet-contrabass.ly][quatuor à cordes avec contrebasse]]
- [[file:lilypond/template/string-quintet.ly][quintette à cordes]]
- [[file:lilypond/template/string-quintet-symmetric.ly][quintette à cordes symétrique]]
- [[file:lilypond/template/string-quintet-contrabass.ly][quintette à cordes avec contrebasse]]
- [[file:lilypond/template/string-sextet.ly][sextuor à cordes]]
- [[file:lilypond/template/string-septet.ly][septuor à cordes]]
- [[file:lilypond/template/piano-quintet.ly][quintette à clavier]]
- [[file:lilypond/template/keyboards.ly][ensemble de claviers]]
- [[file:lilypond/template/drums.ly][ensemble de percussions]]
- [[file:lilypond/template/boudoir.ly][boudoir]]
- [[file:lilypond/template/chamber.ly][ensemble de musique de chambre]]
- [[file:lilypond/template/jazz.ly][ensemble de jazz]]

** Variables globales

On peut placer les variables globales dans des fichiers séparés, inclus
dans le fichier principal :

- [[file:template/global/global.org][variables globales]]

Fichiers source lilypond :

- [[file:lilypond/template/global/global.glob.ly][variables globales]]

** Mélodies incluses

On peut placer les thèmes mélodiques dans des fichiers séparés,
inclus dans le fichier principal :

- [[file:template/melody/melodie.org][thèmes mélodiques]]

Fichiers source lilypond :

- [[file:lilypond/template/melody/mel-3-2-4.mld.ly][mesure 3/4, carrure 2x4]]
- [[file:lilypond/template/melody/mel-4-2-4.mld.ly][mesure 4/4, carrure 2x4]]
- [[file:lilypond/template/melody/mel-2-2-4.mld.ly][mesure 2/2, carrure 2x4]]
- [[file:lilypond/template/melody/mel-4-3-2.mld.ly][mesure 4/4, carrure 3x2]]
- [[file:lilypond/template/melody/mel-2-3-2.mld.ly][mesure 2/2, carrure 3x2]]
- [[file:lilypond/template/melody/mel-3-3-2.mld.ly][mesure 3/4, carrure 3x2]]

** Dépôt

Vous pouvez retrouver l’intégralité des modèles lilypond sur ce
dépôt :

- [[https://gitlab.com/orduval/lilypond-templates]]
