musica/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2024-04-28 dim 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eclats de vers : Opus : Musica</title>
<meta name="author" content="chimay" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style/defaut.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Eclats de vers : Opus : Musica</h1>
<p>
<a href="../index.html">Retour à l’accueil</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfcdd903">1. Modèles lilypond</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfcdd903" class="outline-2">
<h2 id="orgfcdd903"><span class="section-number-2">1.</span> Modèles lilypond</h2>
<div class="outline-text-2" id="text-1">
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org07e7fa1">1.1. Introduction</a></li>
<li><a href="#orge2fef87">1.2. Méta-orchestre</a></li>
<li><a href="#org0b45dff">1.3. Fichiers principaux</a></li>
<li><a href="#org6c4bceb">1.4. Variables globales</a></li>
<li><a href="#org87a16c5">1.5. Mélodies incluses</a></li>
<li><a href="#org5e8c5dc">1.6. Dépôt</a></li>
</ul>
</div>
</div>

<div id="outline-container-org07e7fa1" class="outline-3">
<h3 id="org07e7fa1"><span class="section-number-3">1.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Les fichiers présentés dans ce chapitre sont des modèles d’orchestres
disponibles en format <a href="https://lilypond.org/">lilypond</a>. Pour une
navigation plus rapide, le pliage de texte (folding) des éditeurs
<a href="https://www.vim.org/">vim</a> / <a href="https://neovim.io/">neovim</a> est inclus.
</p>
</div>
</div>

<div id="outline-container-orge2fef87" class="outline-3">
<h3 id="orge2fef87"><span class="section-number-3">1.2.</span> Méta-orchestre</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Le fichier le plus important est le
<a href="lilypond/template/meta.ly">méta-orchestre</a>, qui contient
de nombreux instruments et groupes d’instruments. Vous pouvez
l’utiliser pour construire un orchestre à la carte, en décommentant
ou commentant les instruments et les groupes dans la section "book" à
la fin du fichier, respectivement pour les activer ou les désactiver.
</p>

<p>
Le fichier <a href="lilypond/template/neutral.ly">neutre</a> est pareil,
mais tous les intruments et groupes sont commentés, en attente d’être
choisis.
</p>

<p>
Les thèmes mélodiques peuvent s’insérer dans les définitions des
variables mélodiques commençant par "voice". Par exemple, la variable
"voicePianoRight" contient la mélodie de la main droite au piano.
</p>

<p>
Dans le cas d’un groupe d’instrument qui recouvre une large étendue
de notes, les voix du groupe sont nommées depuis soprano (la plus aiguë)
jusqu’à basse (la plus grave). Par exemple, pour un quintette à
cordes, ce sera :
</p>

<ul class="org-ul">
<li>voiceStringQuintetSoprano</li>
<li>voiceStringQuintetMezzo</li>
<li>voiceStringQuintetAlto</li>
<li>voiceStringQuintetTenor</li>
<li>voiceStringQuintetBass</li>
</ul>

<p>
Voici la liste des instruments et groupes que ce fichier contient :
</p>

<ul class="org-ul">
<li>chant
<ul class="org-ul">
<li>voix individuelles
<ul class="org-ul">
<li>soprano</li>
<li>mezzo</li>
<li>alto</li>
<li>contre-ténor</li>
<li>ténor</li>
<li>baryton</li>
<li>basse</li>
</ul></li>
<li>quatuor vocal
<ul class="org-ul">
<li>soprano alto ténor basse</li>
</ul></li>
<li>quintette vocal
<ul class="org-ul">
<li>soprano mezzo alto ténor basse</li>
</ul></li>
<li>sextuor vocal
<ul class="org-ul">
<li>soprano mezzo alto ténor baryton basse</li>
</ul></li>
<li>septuor vocal
<ul class="org-ul">
<li>soprano mezzo alto contre-ténor ténor baryton basse</li>
</ul></li>
</ul></li>
<li>bois
<ul class="org-ul">
<li>paires de bois individuels
<ul class="org-ul">
<li>flûtes
<ul class="org-ul">
<li>grande flûte traversière</li>
<li>flûte alto</li>
</ul></li>
<li>2 hautbois</li>
<li>2 clarinettes</li>
<li>2 cors anglais</li>
<li>2 bassons</li>
<li>2 saxophones soprano</li>
<li>2 saxophones alto</li>
<li>2 saxophones ténor</li>
<li>2 saxophones baryton</li>
<li>cornemuse</li>
</ul></li>
<li>quatuor de bois
<ul class="org-ul">
<li>grande flûte traversière</li>
<li>hautbois</li>
<li>clarinette</li>
<li>basson</li>
</ul></li>
<li>quintette de bois
<ul class="org-ul">
<li>grande flûte traversière</li>
<li>hautbois</li>
<li>clarinette</li>
<li>cor anglais</li>
<li>basson</li>
</ul></li>
<li>sextuor de bois
<ul class="org-ul">
<li>grande flûte traversière</li>
<li>flûte alto</li>
<li>hautbois</li>
<li>clarinette</li>
<li>cor anglais</li>
<li>basson</li>
</ul></li>
<li>quatuor de saxophones
<ul class="org-ul">
<li>2 saxophones soprano</li>
<li>2 saxophones ténor</li>
</ul></li>
</ul></li>
<li>cuivres
<ul class="org-ul">
<li>paires de cuivres individuels
<ul class="org-ul">
<li>2 trompettes</li>
<li>2 cors d’harmonie</li>
<li>2 trombones</li>
<li>2 tubas</li>
</ul></li>
<li>quatuor de cuivres
<ul class="org-ul">
<li>2 trompettes</li>
<li>2 cors d’harmonie</li>
</ul></li>
<li>quintette de cuivres
<ul class="org-ul">
<li>2 trompettes</li>
<li>1 cor d’harmonie</li>
<li>1 trombone</li>
<li>1 tuba</li>
</ul></li>
</ul></li>
<li>anches libres
<ul class="org-ul">
<li>harmonica</li>
</ul></li>
<li>instruments à vent avec clavier
<ul class="org-ul">
<li>orgue sans pédalier
<ul class="org-ul">
<li>orgue positif, harmonium, orgue hammond</li>
</ul></li>
<li>orgue avec pédalier
<ul class="org-ul">
<li>orgue positif, harmonium, orgue hammond, orgue d’église</li>
</ul></li>
<li>accordéon</li>
<li>concertina</li>
</ul></li>
<li>cordes frottées
<ul class="org-ul">
<li>paires de cordes frottées individuelles
<ul class="org-ul">
<li>2 violons</li>
<li>2 violons alto</li>
<li>2 violoncelles</li>
<li>2 contrebasses</li>
</ul></li>
<li>quatuor à cordes
<ul class="org-ul">
<li>2 violons</li>
<li>1 violon alto</li>
<li>1 violoncelle</li>
</ul></li>
<li>quatuor à cordes symétrique
<ul class="org-ul">
<li>2 violons</li>
<li>2 violoncelles</li>
</ul></li>
<li>quatuor à cordes avec contrebasse
<ul class="org-ul">
<li>violon</li>
<li>violon alto</li>
<li>violoncelle</li>
<li>contrebasse</li>
</ul></li>
<li>quintette à cordes
<ul class="org-ul">
<li>2 violons</li>
<li>2 violons alto</li>
<li>1 violoncelle</li>
</ul></li>
<li>quintette à cordes symétrique
<ul class="org-ul">
<li>2 violons</li>
<li>1 violon alto</li>
<li>2 violoncelles</li>
</ul></li>
<li>quintette à cordes avec contrebasse
<ul class="org-ul">
<li>2 violons</li>
<li>1 violon alto</li>
<li>1 violoncelle</li>
<li>1 contrebasse</li>
</ul></li>
<li>sextuor à cordes
<ul class="org-ul">
<li>2 violons</li>
<li>2 violons alto</li>
<li>2 violoncelles</li>
</ul></li>
<li>septuor à cordes
<ul class="org-ul">
<li>2 violons</li>
<li>2 violons alto</li>
<li>2 violoncelles</li>
<li>1 contrebasse</li>
</ul></li>
</ul></li>
<li>cordes pincées
<ul class="org-ul">
<li>luth
<ul class="org-ul">
<li>portée ordinaire</li>
<li>tablature</li>
</ul></li>
<li>archiluth
<ul class="org-ul">
<li>portée ordinaire</li>
<li>tablature</li>
</ul></li>
<li>théorbe
<ul class="org-ul">
<li>portée ordinaire</li>
<li>tablature</li>
</ul></li>
<li>guitare
<ul class="org-ul">
<li>portée ordinaire</li>
<li>tablature</li>
</ul></li>
<li>guitare basse
<ul class="org-ul">
<li>portée ordinaire</li>
<li>tablature</li>
</ul></li>
<li>sitar</li>
<li>harpe</li>
</ul></li>
<li>cordes frappées
<ul class="org-ul">
<li>dulcimer</li>
</ul></li>
<li>instruments à cordes avec clavier
<ul class="org-ul">
<li>viola organista
<ul class="org-ul">
<li>clavier avec cordes frottées par des roues</li>
</ul></li>
<li>clavecin</li>
<li>clavecin avec pédalier</li>
<li>clavicorde</li>
<li>piano</li>
</ul></li>
<li>percussions
<ul class="org-ul">
<li>glockenspiel</li>
<li>vibraphone</li>
<li>marimba</li>
<li>carillon tubulaire</li>
<li>batterie</li>
</ul></li>
<li>percussions avec clavier
<ul class="org-ul">
<li>célesta</li>
</ul></li>
</ul>

<p>
Ces instruments et groupes sont disposés le plus possible avec deux
mélodies par portée, pour obtenir une partition plus compacte.
</p>

<p>
Les instruments individuels tirent leur nom du fait qu’on peut
activer un seul type d’instrument à la fois. Certains d’entre-eux
sont en fait disponibles par paires : flûtes, hautbois, trompettes,
trombones, violons, violoncelles, etc. Chaque paire d’instruments
est alors representés comme deux mélodies disposées sur une même
portée. Si vous avez uniquement besoin d’un seul de ces instruments,
il est possible de ne remplir que la variable mélodique du premier,
par exmple "voiceFluteOne" pour la première flûte. Pour retrouver
la représentation habituelle des notes sur une portée à une voix,
on peut alors insérer "\oneVoice" au début de la variable.
</p>
</div>
</div>

<div id="outline-container-org0b45dff" class="outline-3">
<h3 id="org0b45dff"><span class="section-number-3">1.3.</span> Fichiers principaux</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Les autres modèles d’orchestres sont dérivés du
méta-orchestre. Voici quelques exemples de partitions (au format pdf)
générées avec ces fichiers :
</p>

<ul class="org-ul">
<li><a href="template/meta.html">méta-orchestre</a></li>
<li><a href="template/vocal-quartet.html">quatuor vocal</a></li>
<li><a href="template/vocal-quintet.html">quintet vocal</a></li>
<li><a href="template/vocal-sextet.html">sextuor vocal</a></li>
<li><a href="template/vocal-septet.html">septuor vocal</a></li>
<li><a href="template/winds.html">ensemble d’instruments à vent</a></li>
<li><a href="template/woodwinds.html">ensemble de bois</a></li>
<li><a href="template/brass.html">ensemble de cuivres</a></li>
<li><a href="template/strings.html">ensemble d’instruments à cordes</a></li>
<li><a href="template/string-quartet.html">quatuor à cordes</a> :
2 violons, 1 violon alto, 1 violoncelle</li>
<li><a href="template/string-quartet-symmetric.html">quatuor à cordes symétrique</a> :
2 violons et 2 violoncelles</li>
<li><a href="template/string-quartet-contrabass.html">quatuor à cordes avec contrebasse</a> :
violon, violon alto, violoncelle et contrebasse</li>
<li><a href="template/string-quintet.html">quintette à cordes</a> :
2 violons, 2 violons alto, 1 violoncelle</li>
<li><a href="template/string-quintet-symmetric.html">quintette à cordes symétrique</a> :
2 violons, 1 violon alto, 2 violoncelles</li>
<li><a href="template/string-quintet-contrabass.html">quintette à cordes avec contrebasse</a> :
2 violons, 1 violon alto, 1 violoncelles, 1 contrebasse</li>
<li><a href="template/string-sextet.html">sextuor à cordes</a></li>
<li><a href="template/string-septet.html">septuor à cordes</a></li>
<li><a href="template/piano-quintet.html">quintette à clavier</a></li>
<li><a href="template/keyboards.html">ensemble de claviers</a></li>
<li><a href="template/drums.html">ensemble de percussions</a></li>
<li><a href="template/boudoir.html">boudoir</a> : flûtes, quatuor à cordes, clavier</li>
<li><a href="template/chamber.html">ensemble de musique de chambre</a></li>
<li><a href="template/jazz.html">ensemble de jazz</a></li>
</ul>

<p>
et les fichiers source lilypond :
</p>

<ul class="org-ul">
<li><a href="lilypond/template/neutral.ly">neutre</a> : tous les instruments sont commentés, en attente d’être choisis</li>
<li><a href="lilypond/template/meta.ly">méta-orchestre</a></li>
<li><a href="lilypond/template/vocal-quartet.ly">quatuor vocal</a></li>
<li><a href="lilypond/template/vocal-quintet.ly">quintette vocal</a></li>
<li><a href="lilypond/template/vocal-sextet.ly">sextuor vocal</a></li>
<li><a href="lilypond/template/vocal-septet.ly">septuor vocal</a></li>
<li><a href="lilypond/template/winds.ly">ensemble d’instruments à vent</a></li>
<li><a href="lilypond/template/woodwinds.ly">ensemble de bois</a></li>
<li><a href="lilypond/template/brass.ly">ensemble de cuivres</a></li>
<li><a href="lilypond/template/strings.ly">ensemble d’instruments à cordes</a></li>
<li><a href="lilypond/template/string-quartet.ly">quatuor à cordes</a></li>
<li><a href="lilypond/template/string-quartet-symmetric.ly">quatuor à cordes symétrique</a></li>
<li><a href="lilypond/template/string-quartet-contrabass.ly">quatuor à cordes avec contrebasse</a></li>
<li><a href="lilypond/template/string-quintet.ly">quintette à cordes</a></li>
<li><a href="lilypond/template/string-quintet-symmetric.ly">quintette à cordes symétrique</a></li>
<li><a href="lilypond/template/string-quintet-contrabass.ly">quintette à cordes avec contrebasse</a></li>
<li><a href="lilypond/template/string-sextet.ly">sextuor à cordes</a></li>
<li><a href="lilypond/template/string-septet.ly">septuor à cordes</a></li>
<li><a href="lilypond/template/piano-quintet.ly">quintette à clavier</a></li>
<li><a href="lilypond/template/keyboards.ly">ensemble de claviers</a></li>
<li><a href="lilypond/template/drums.ly">ensemble de percussions</a></li>
<li><a href="lilypond/template/boudoir.ly">boudoir</a></li>
<li><a href="lilypond/template/chamber.ly">ensemble de musique de chambre</a></li>
<li><a href="lilypond/template/jazz.ly">ensemble de jazz</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6c4bceb" class="outline-3">
<h3 id="org6c4bceb"><span class="section-number-3">1.4.</span> Variables globales</h3>
<div class="outline-text-3" id="text-1-4">
<p>
On peut placer les variables globales dans des fichiers séparés, inclus
dans le fichier principal :
</p>

<ul class="org-ul">
<li><a href="template/global/global.html">variables globales</a></li>
</ul>

<p>
Fichiers source lilypond :
</p>

<ul class="org-ul">
<li><a href="lilypond/template/global/global.glob.ly">variables globales</a></li>
</ul>
</div>
</div>

<div id="outline-container-org87a16c5" class="outline-3">
<h3 id="org87a16c5"><span class="section-number-3">1.5.</span> Mélodies incluses</h3>
<div class="outline-text-3" id="text-1-5">
<p>
On peut placer les thèmes mélodiques dans des fichiers séparés,
inclus dans le fichier principal :
</p>

<ul class="org-ul">
<li><a href="template/melody/melodie.html">thèmes mélodiques</a></li>
</ul>

<p>
Fichiers source lilypond :
</p>

<ul class="org-ul">
<li><a href="lilypond/template/melody/mel-3-2-4.mld.ly">mesure 3/4, carrure 2x4</a></li>
<li><a href="lilypond/template/melody/mel-4-2-4.mld.ly">mesure 4/4, carrure 2x4</a></li>
<li><a href="lilypond/template/melody/mel-2-2-4.mld.ly">mesure 2/2, carrure 2x4</a></li>
<li><a href="lilypond/template/melody/mel-4-3-2.mld.ly">mesure 4/4, carrure 3x2</a></li>
<li><a href="lilypond/template/melody/mel-2-3-2.mld.ly">mesure 2/2, carrure 3x2</a></li>
<li><a href="lilypond/template/melody/mel-3-3-2.mld.ly">mesure 3/4, carrure 3x2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5e8c5dc" class="outline-3">
<h3 id="org5e8c5dc"><span class="section-number-3">1.6.</span> Dépôt</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Vous pouvez retrouver l’intégralité des modèles lilypond sur ce
dépôt :
</p>

<ul class="org-ul">
<li><a href="https://gitlab.com/orduval/lilypond-templates">https://gitlab.com/orduval/lilypond-templates</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: chimay</p>
<p class="date">Created: 2024-04-28 dim 12:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
